docs: add preview and update readme
